app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT `cards`.* FROM `cards`

  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save
---
INSERT INTO `cards` (`card`, `subsystem`, `created_at`, `updated_at`) VALUES ('2', 'DL card', '2021-03-10 05:08:17.258983', '2021-03-10 05:08:17.258983')

    def set_card
      @card = Card.find(params[:id])
---
SELECT `cards`.* FROM `cards` WHERE `cards`.`id` = 1 LIMIT 1